ПаркАттракционов/src/Documents/ПосещениеАттракциона/ПосещениеАттракциона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПосещениеАттракциона</name>
  <registerRecords>AccumulationRegister.АктивныеПосещения</registerRecords>
  <attributes>
    <name>Аттракцион</name>
    <type>
      <types>CatalogRef.Аттракционы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </attributes>
</mdclass:Document>

ПаркАттракционов/src/AccumulationRegisters/АктивныеПосещения/АктивныеПосещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АктивныеПосещения</name>
  <resources>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аттракцион</name>
    <type>
      <types>CatalogRef.Аттракционы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ПаркАттракционов/src/Documents/ПосещениеАттракциона/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр АктивныеПосещения
	Движения.АктивныеПосещения.Записывать = Истина;
	Движение = Движения.АктивныеПосещения.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Основание = Основание;
	Движение.Аттракцион = Аттракцион;
	Движение.КоличествоПосещений = 1;
	
	// Записываем изменения при проведении
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктивныеПосещенияОстатки.Основание
	|ИЗ
	|	РегистрНакопления.АктивныеПосещения.Остатки(, Основание = &Основание) КАК АктивныеПосещенияОстатки
	|ГДЕ
	|	АктивныеПосещенияОстатки.КоличествоПосещенийОстаток < 0";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина; // То есть запрещаем проведение документа
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Билет уже был использован ранее";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Основание"; 
		Сообщение.Сообщить();
	КонецЕсли;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ  
КонецПроцедуры
